In [1]:
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
get_ipython().run_line_magic('matplotlib','inline')

In [4]:
data=pd.read_csv('Population.csv',encoding="unicode_escape")
data

,region,country,country_code,age_group,age_lower,age_upper,pop_date,pop_male,pop_female,pop_both
0,Europe,Austria,AUT,'0-4,0.0,4.0,2019-01-01,224072,211061,435133
1,Europe,Austria,AUT,'5-14,5.0,14.0,2019-01-01,433500,410059,843559
2,Europe,Austria,AUT,'15-24,15.0,24.0,2019-01-01,500178,469589,969767
3,Europe,Austria,AUT,'25-34,25.0,34.0,2019-01-01,615441,591433,1206874
4,Europe,Austria,AUT,'35-44,35.0,44.0,2019-01-01,585813,580801,1166614
...,...,...,...,...,...,...,...,...,...,...
793,Asia,Japan,JPN,'60-69,60.0,69.0,2021-10-01,7478079,7782324,15260403
794,Asia,Japan,JPN,'70-79,70.0,79.0,2021-10-01,7555827,8828023,16383850
795,Asia,Japan,JPN,'80-89,80.0,89.0,2021-10-01,3697701,5737198,9434899
796,Asia,Japan,JPN,'90+,90.0,NaN,2021-10-01,645020,1881459,2526479
797,Asia,Japan,JPN,'Total,NaN,NaN,2021-10-01,61019059,64483231,125502290

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 798 entries, 0 to 797
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   region        798 non-null    object
 1   country       798 non-null    object
 2   country_code  798 non-null    object
 3   age_group     798 non-null    object
 4   age_lower     729 non-null    float64
 5   age_upper     660 non-null    float64
 6   pop_date      798 non-null    object
 7   pop_male      798 non-null    int64
 8   pop_female    798 non-null    int64
 9   pop_both      798 non-null    int64
dtypes: float64(2), int64(3), object(5)
memory usage: 62.5+ KB

In [7]:
data[data["age_lower"]<=0]=1

In [8]:
data[data["age_lower"]<=0]

Empty DataFrame
Columns: [region, country, country_code, age_group, age_lower, age_upper, pop_date, pop_male, pop_female, pop_both]
Index: []

In [24]:
data[data["age_lower"].isnull()]

,region,country,country_code,age_group,age_lower,age_upper,pop_date,pop_male,pop_female,pop_both
10,Europe,Austria,AUT,'Total,NaN,NaN,2019-01-01,4357033,4501742,8858775
21,Europe,Austria,AUT,'Total,NaN,NaN,2020-01-01,4378772,4522292,8901064
32,Europe,Austria,AUT,'Total,NaN,NaN,2021-01-01,4396952,4535712,8932664
43,Europe,Austria,AUT,'Total,NaN,NaN,2022-01-01,4425485,4553444,8978929
50,Europe,Belgium,BEL,'Total,NaN,NaN,2020-01-01,5660064,5832577,11492641
...,...,...,...,...,...,...,...,...,...,...
743,Europe,England & Wales,EAW,'Total,NaN,NaN,2019-06-30,29382509,30057331,59439840
764,Europe,England & Wales,EAW,'Total,NaN,NaN,2020-06-30,29546342,30173382,59719724
775,Asia,Japan,JPN,'Total,NaN,NaN,2019-10-01,61411332,64755616,126166948
786,Asia,Japan,JPN,'Total,NaN,NaN,2020-10-01,61349581,64796518,126146099
797,Asia,Japan,JPN,'Total,NaN,NaN,2021-10-01,61019059,64483231,125502290

In [33]:
data.duplicated().sum()

71

In [34]:
data=data.drop_duplicates()

In [35]:
data.duplicated().sum()

0

In [37]:
data["age_lower"].isnull().sum()

66

In [46]:
data2=data[data["age_upper"]<18]
data2["pop_both"].sum()

205884453

In [48]:
data2=data[(data["age_upper"]>18)&(data["age_upper"]<40)]
data2["pop_both"].sum()

971797141

In [50]:
data2=data[data["age_upper"]>40]
data2["pop_both"].sum()

1824578291

In [ ]:
#The group most targeted by the Coronavirus are the elderly